cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактированиеЦеныВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольВремениПосещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЧужихРазмещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНовыйПарольПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРозничныйМагазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idДиалогаТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КтоМожетПросматриватьСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиИнтернетПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/ОтметитьПользователей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 	Все.Ссылка Пользователь, 1 Картинка, Все.Наименование, ЕСТЬNULL(Пометка, ЛОЖЬ) Пометка
	|ИЗ 		Справочник.ГруппыПользователей Все
	|ЛЕВОЕ СОЕДИНЕНИЕ 	(ВЫБРАТЬ Ссылка, Истина Пометка ИЗ Справочник.ГруппыПользователей ГДЕ НЕ ПометкаУдаления И Ссылка В (&МассивОтмеченных)) Отмеченные
	|ПО 				Все.Ссылка = Отмеченные.Ссылка
	|ГДЕ 		НЕ Все.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 	Все.Ссылка Пользователь, 0 Картинка, Все.Наименование, ЕСТЬNULL(Пометка, ЛОЖЬ) Пометка
	|ИЗ 		Справочник.Пользователи Все
	|ЛЕВОЕ СОЕДИНЕНИЕ 	(ВЫБРАТЬ Ссылка, Истина Пометка ИЗ Справочник.Пользователи ГДЕ НЕ ПометкаУдаления И ФизЛицо.Родитель = &Родитель И Ссылка В (&МассивОтмеченных)) Отмеченные
	|ПО 				Все.Ссылка = Отмеченные.Ссылка
	|ГДЕ 		НЕ Все.ПометкаУдаления И ФизЛицо.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ По Картинка Убыв, Наименование
	|");
	
	Запрос.УстановитьПараметр("Родитель", 			Справочники.ФизическиеЛица.НайтиПоНаименованию("Сотрудники", Истина));
	Запрос.УстановитьПараметр("МассивОтмеченных", 	Параметры.СписокОтмеченных);
	Пользователи.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Массив = Новый Массив;
	
	Строки = Пользователи.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого Строка Из Строки Цикл Массив.Добавить(Строка.Пользователь) КонецЦикла;
		
	Закрыть(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсехНажатие(Элемент)
	
	Массив = Новый Массив;
	Массив.Добавить(Неопределено);
	Закрыть(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсехНажатие(Элемент)
	
	Закрыть(Новый Массив);
	
КонецПроцедуры
